---
type: RebarReinforcementData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# RebarReinforcementData

`Autodesk.Revit.DB.Structure.RebarReinforcementData` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2017 | `public static RebarReinforcementData Create ( ElementId rebarId , int iEnd )` |
| Property | End | 2017 | `public int End { get ; set ; }` |
| Property | RebarId | 2017 | `public ElementId RebarId { get ; set ; }` |